/*
 Navicat Premium Data Transfer

 Source Server         : localhost_3306
 Source Server Type    : MariaDB
 Source Server Version : 100311
 Source Host           : localhost:3306
 Source Schema         : mhpdl

 Target Server Type    : MariaDB
 Target Server Version : 100311
 File Encoding         : 65001

 Date: 04/08/2023 22:06:48
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for mhpquest
-- ----------------------------
DROP TABLE IF EXISTS `mhpquest`;
CREATE TABLE `mhpquest`  (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `mType` int(11) NULL DEFAULT 0 COMMENT '[0]官方[1]自制',
  `Num` int(11) NULL DEFAULT NULL,
  `Title` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `TitleCN` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Star` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Reward` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Contract` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Time` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Win` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `WinCN` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Lose` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `LoseCN` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Map` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `MapCN` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Conditions` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `ConditionsCN` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Info` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `InfoCN` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `FileUri` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `DownloadNum` int(11) NULL DEFAULT 0,
  PRIMARY KEY (`ID`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 60022 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of mhpquest
-- ----------------------------
INSERT INTO `mhpquest` VALUES (1, 0, 60002, '【官方】巨大龍を食い止めろ！', '【官方】阻止巨龍入侵！', '★★★★★★★★', '5600ｚ', '1200ｚ', '30分', 'ラオシャンロンの討伐', '讨伐老山龙', '砦の崩壊　報酬金ゼロ　タイムアップ', '砦的崩溃  报酬金为零  时间结束', '砦', '砦', 'なし', '无', '依頼主：砦の兵士長<BR>ラオシャンロンが、この砦を目指して進撃を開始している！食い止めなければ甚大な被害が出る…砦の設備をフルに使い、奴を討伐してくれ！頼んだぞ！', '委托人：砦的士兵長<BR>老山龍以砦為目標開始進攻了！如果不阻止的話會造成巨大的損失……充分使用砦的設備，討伐那家夥吧！拜托妳了！', '/BONUS/MHPSP/m60002.mib', 0);
INSERT INTO `mhpquest` VALUES (2, 0, 60001, '【官方】幻の獣を追え！', '【官方】追捕幻獸！', '★★★', '4200ｚ', '750ｚ', '50分', 'キリンの討伐', '讨伐麒麟', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', '沼地', '沼低', 'なし', '无', '依頼主：街の警備兵<BR>誰も信じちゃくれないが、俺は確かに見たんだ！淡い光をまとった、幻獣の姿をな！奴を狩ればものすごい宝が…！力あるハンターに調査を頼む！', '委托人：街上的警備兵<BR>雖然誰都不相信，但我確實看到了！裹著淡淡的光，幻獸的身姿！要是打到那家夥的話，可就有了不得的財寶了…！拜托有力量的獵人調查！', '/BONUS/MHPSP/m60001.mib', 0);
INSERT INTO `mhpquest` VALUES (3, 0, 60015, '【官方】ファミ通クック連続討伐！', '【官方】連續討伐Fami通大怪鳥！', '★★★', '1200ｚ', '300ｚ', '30分', 'タイムアップもしくは、ネコタクチケットの納品', '时间到或交付猫宅卷', '２頭以上を討伐せずにタイムアップ、もしくは報酬金ゼ', '没有讨伐两只以上，报酬金为零', '森と丘', '森丘', '防具未装备', '不装备防具', '依頼主：ファミ通ＭＨＰ攻略班<BR>クックを倒しまくれるタフなハンターを募集。辛くなったらそこでクリアーしてもオーケーだ。たくさん倒す事が出来れば、ステキなチケットを進呈！', '委托人：Fami通MHP攻略班<BR>募集能打倒庫克的頑強獵人。如果能的話在那裏做也可以。如果能打倒很多的話，我會送妳很棒的票！', '/BONUS/MHPSP/m60015.mib', 0);
INSERT INTO `mhpquest` VALUES (4, 0, 60004, '【官方】黒龍伝説', '【官方】黑龍傳說', '★★★★★', '6400ｚ', '2400ｚ', '50分', 'ミラボレアスの討伐', '讨伐黑龙', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', 'シュレイド城', '修雷德城', '受注＆参加資格は、ＨＲ２～５', '接受&参加资格为HR2～5', '依頼主：城の兵士長<BR>伝説の黒龍、ミラボレアスの襲来だ！いいか、この戦いに次はない。ここで倒せなければ城は落とされてしまうのだ！全身全霊をかけて挑んでくれ！', '委托人：城的士兵長<BR>傳說中的黑龍，是米拉的來襲！聽好了，這場戰鬥沒有下次了。如果不在這裏倒下的話，城堡就會被攻陷！全身心地挑戰吧！', '/BONUS/MHPSP/m60004.mib', 0);
INSERT INTO `mhpquest` VALUES (5, 0, 60016, '【官方】電撃祭リターンズ！', '【官方】電擊祭回歸！', '★★★', '3200ｚ', '450ｚ', '30分', 'タイムアップもしくは、ネコタクチケットの納品', '时间到或交付猫宅卷', '２頭以上を討伐せずにタイムアップ、もしくは報酬金ゼロ', '没有讨伐两只以上，报酬金为', 'ジャングル	', '密林', 'ハンマー・限定クエスト', '锤子限定', '依頼主：電撃ＰＳ　ポリタン<BR>ポリタンからの新たな挑戦！？パワーアップしたあのハンマーを手にする資格があるのは、次々に現れる飛龍を恐れぬ勇者たちだけだ！', '委托人：電擊P S  電擊熊<BR>來自電擊熊的新挑戰！？只有不怕不斷出現的飛龍的勇者們才有資格拿到那把力量增強的錘子！', '/BONUS/MHPSP/m60016.mib', 0);
INSERT INTO `mhpquest` VALUES (6, 0, 60012, '【官方】砂まみれの一日', '【官方】充滿沙子的壹日', '★★★', '3200ｚ', '300ｚ', '30分', 'タイムアップまでに、ガレオスを何頭討伐できるか？', '时间到之前，能讨伐几只沙龙/沙龙王？', '５頭以上を討伐せずにタイムアップ、もしくは報酬金ゼロ', '没有讨伐五只以上，报酬金为', '砂原', '沙漠岩地', 'なし', '无', '依頼主：ハンターズギルド<BR>ガレオスの大集団を、できるだけ多く討伐して下さい。討伐数に見合う報酬を用意してあります。', '委托人：獵人公會<BR>請盡量多討伐沙龍的大集團。準備了與討伐數相應的報酬。', '/BONUS/MHPSP/m60012.mib', 0);
INSERT INTO `mhpquest` VALUES (7, 0, 60009, '【官方】熱風と落雷', '【官方】熱風與雷電', '★★★★★★★', '7200ｚ', '2200ｚ', '50分', 'キリン２頭の討伐', '讨伐两只麒麟', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', '決戰場', '决斗场', '受注＆参加資格はＨＲ３～５	', '接受&参加资格为HR3～5', '依頼主：火山地帯の炭坑夫たち<BR>俺たちゃウソはつかねぇ！火口近くの様子が変なんだ！あの<<異常>>な数の稲妻は、あんたら狩人が幻獣って呼ぶ生き物の仕業じゃねぇのか！？', '委托人：火山地帶的煤礦夫們<BR>我們是不會說謊的！火口附近的情況很奇怪！那個<<異常>>數量的閃電，妳們不是獵人稱之為幻獸的生物幹的麽！？', '/BONUS/MHPSP/m60009.mib', 0);
INSERT INTO `mhpquest` VALUES (8, 0, 60017, '【官方】ファミ通双蒼飛龍を狩れ！', '【官方】狩獵Fami通雙蒼火！', '★★', '4800ｚ', '500ｚ', '30分', 'リオレウス（蒼）２頭の討伐', '讨伐两只苍火龙', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', '大闘技場', '大竞技场', '受注＆参加資格は防具未装備', '不装备防具', '依頼主：ファミ通ＭＨＰ攻略班<BR>蒼飛龍２体を相手に立ち回れる自信があるなら、この闘技に挑戦して見ませんか？もちろん、怖いもの見たさからの参加も歓迎。刺激的な時間をあなたに！', '委托人：Fami通MHP攻略班<BR>如果有自信能與蒼飛龍2只對手站起來的話，要不要挑戰壹下這個競技？當然，也歡迎大家觀看恐怖的節目。給妳刺激的時間', '/BONUS/MHPSP/m60017.mib', 0);
INSERT INTO `mhpquest` VALUES (9, 0, 60011, '【官方】天と地の覇者ＭＨｉ配信記念', '【官方】天地霸者 M H i 配信紀念', '★★★★★★★', '9000ｚ', '2000ｚ', '50分', 'リオレイア（桜）とリオレウス（蒼）の討伐', '讨伐樱火龙和苍火龙', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', '森と丘', '森丘', '受注＆参加資格はＨＲ３～５', '接受&参加资格为HR3～5', '依頼主：ハンターズギルド幹部<BR>ケータイ版『モンスターハンターｉ』配信記念クエスト開催！雌雄の飛竜が、すぐそばの丘陵地帯に現れた。', '委托人：獵人公會幹部<BR>手機版《怪物獵人i》發布紀念任務開始！雌雄的飛龍馬上出現在旁邊的丘陵地帶。', '/BONUS/MHPSP/m60011.mib', 0);
INSERT INTO `mhpquest` VALUES (10, 0, 60007, '【官方】幻の怪鳥', '【官方】幻之怪鳥', '★★★', '6400ｚ', '1600ｚ', '50分', 'イャンクックの討伐', '讨伐大怪鸟', '報奨金ゼロ　タイムアップ', '报酬金为零  时间结束', 'ジャングル', '密林', '受注＆参加資格は防具未装備', '不装备防具', '依頼主：ハンターズギルド<BR>密林地帯にて、前代未聞の怪鳥が目撃されました！ハンターの皆様は真相を確かめるべく、密林地帯に急行して下さい！', '委托人：獵人公會<BR>在密林地帶，目擊了前所未聞的怪鳥！各位獵人為了確認真相，請趕快前往密林地帶！', '/BONUS/MHPSP/m60007.mib', 0);
INSERT INTO `mhpquest` VALUES (11, 0, 60010, '【官方】２色の双角・闘技場', '【官方】二色的雙角・鬥技場', '★★★★★★★', '9000ｚ', '1400ｚ', '50分', 'ディアブロスとディアブロス（黒）の討伐', '讨伐角龙和黑角龙', '報酬金ゼロ　タイムアップ', '报酬金为零  时间结束', '大闘技場', '大竞技场', '受注＆参加資格はＨＲ３～５', '接受&参加资格为HR3～5', '依頼主：闘技場の経営者<BR>ハンターが己の腕前を披露する闘技場！黒の双角と砂色の双角を相手に怖気ることなく全霊を尽くす覚悟がある者よ！この闘技場にてその全てを披露せよ！', '委托人：競技場的經營者<BR>獵人展示自己的能力的鬥技場！有著不用害怕對手而全心全意付出的覺悟的人啊！在這個鬥技場展示全部！', '/BONUS/MHPSP/m60010.mib', 0);
INSERT INTO `mhpquest` VALUES (12, 0, 60005, '【官方】災厄降臨', '【官方】災禍降臨', '★★★★★★★★', '12000ｚ', '3200ｚ', '50分', 'ミラボレアス（紅）の討伐', '讨伐红黑龙', '報奨金ゼロ　タイムアップ', '报酬金为零  时间结束', '決戰場', '决斗场', '受注＆参加資格はＨＲ５', '接受&参加资格为HR5', '依頼主：ギルドマスター<BR>なんと恐ろしいことじゃ…。黒龍ミラボレアスが火山地帯の火口付近に潜み、不穏なうめきを放ちつつ、力を蓄えておる。この悪しき予兆を防ぐのじゃ！', '委托人：行會老板<BR>多麽可怕的事啊…。黑龍米拉波雷亞斯潛藏在火山地帶的火山口附近，壹邊發出不詳呻吟，壹邊積蓄著力量。要防止這個壞的預兆！', '/BONUS/MHPSP/m60005.mib', 0);
INSERT INTO `mhpquest` VALUES (13, 0, 60013, '【官方】肉焼き祭り・リベンジ！', '【官方】焼肉祭・復仇！', '★★', '100ｚ', '0ｚ', '30分', 'タイムアップまでに、こんがり肉を何個納品できるか？', '时间到之前，能交付几个烤熟的肉？', '報奨金ゼロ', '报酬金为零', 'ジャングル', '密林', 'なし', '无', '依頼主：ギルドのボスとその娘<BR>さあ、焼肉パーティの再開だ！時間内にこんがり肉をたくさん焼いてくれば、持ち込んだ数に応じてビッグな報酬をドドンとプレゼントしちゃいますよ！', '委托人：行會老板和他的女兒<BR>那麽，烤肉派對重新開始了！如果在時間內烤很多金黃的肉的話，根據帶來的數量會給妳很大的報酬哦！', '/BONUS/MHPSP/m60013.mib', 0);
INSERT INTO `mhpquest` VALUES (14, 0, 60014, '【官方】トレジャーハンティング！', '【官方】登山狩獵！', '★★★', '4000ｚ', '1000ｚ', '50分', 'ネコタクチケットの納品', '交付猫宅券', '報奨金ゼロ・タイムアップ', '报酬金为零  时间结束', '森と丘', '森丘', '受注＆参加資格はＨＲ３～５', '接受&参加资格为HR3～5', '依頼主：トレジャーハンター<BR>この地帯の岩には秘宝が眠るとの情報を入手したが、リオレウスが邪魔で探索は難航している。ハンター諸君！まず憎きリオレウスの退治を頼む！', '委托人：寶物獵人<BR>得到了在這個地區的巖石上沈睡著秘寶的情報，但是由於火龍的幹擾，探索陷入了困境。各位獵人！首先拜托消滅憎恨的火龍', '/BONUS/MHPSP/m60014.mib', 0);
INSERT INTO `mhpquest` VALUES (15, 0, 60003, '【官方】岩山龍', '【官方】岩山龍', '★★★★★★★★', '6400ｚ', '2400ｚ', '30分', 'ラオシャンロン（灰）の討伐', '讨伐岩山龙', '砦の崩壊　報奨金ゼロ　タイムアップ', '砦的崩溃  报酬金为零  时间结束', '砦', '砦', '受注＆参加資格はＨＲ５', '接受&参加资格为HR5', '依頼主：砦の兵士長<BR>見たことも無い体色の巨大龍がこの砦を目指し進撃している！食い止めなければ甚大な被害が出る…砦の設備をフルに使い、やつを討伐してくれ！頼んだぞ！', '委托人：砦的士兵長<BR>從未見過的體色的巨龍以這個城堡為目標進行了進攻！如果不制止的話會造成很大的損失……充分使用城堡的設備，討伐那家夥！拜托妳了！', '/BONUS/MHPSP/m60003.mib', 0);
INSERT INTO `mhpquest` VALUES (16, 0, 60006, '【官方】災厄の逆鱗', '【官方】災禍的逆鱗', '★★★★★★★★', '12000ｚ', '3200ｚ', '50分', 'ミラボレアス（紅）の討伐', '讨伐红黑龙', '報奨金ゼロ　タイムアップ', '报酬金为零  时间结束', '決戦場', '决斗场', '受注＆参加資格はＨＲ５', '接受&参加资格为HR5', '依頼主：ギルドマスター<BR>語り継がれてきた伝説をはるかに上回る災厄じゃ…。黒龍の怒りはわれわれの想像を絶しておった！これ以上に惨劇が広がらぬよう、黒龍の怒りを打ち消すのじゃ！', '委托人：行會老板<BR>這是遠遠超過流傳下來的傳說的災難。黑龍的憤怒超出了我們的想象！為了不讓慘劇進壹步擴大，要消除黑龍的憤怒！', '/BONUS/MHPSP/m60006.mib', 0);
INSERT INTO `mhpquest` VALUES (17, 0, 60018, '\r\n【官方】クックフェスティバル', '【官方】羊庫庫節', '★★★★★', '1500ｚ', '450ｚ', '30分', 'タイムアップまでに、イャンクックを何頭討伐できるか？', '时间到之前，能讨伐几只小怪鸟？', '２頭以上を討伐せずにタイムアップ　報奨金ゼロ', '没有讨伐两只以上，报酬金为', '大闘技場', '大竞技场', 'なし', '无', '依頼主：ファミ通ＭＨＰ攻略班<BR>世にも珍しいお祭りのはじまりです！次々現れる小さな怪鳥相手にあなたの力を試してみませんか？今まで感じたことのない奇妙で素敵な時間をあなたに！', '委托人：Fami通MHP攻略班<BR>世上罕見的祭典開始了！讓不斷出現的小怪鳥來試試妳的力量吧？給妳壹個從未體驗過的奇妙美好時光！', '/BONUS/MHPSP/m60018.mib', 0);
INSERT INTO `mhpquest` VALUES (18, 0, 60019, '【官方】天地狂乱', '【官方】天地狂亂', '★★★★★★★★', '18000ｚ', '3000ｚ', '50分', 'リオレイア（金）とリオレウス（銀）の討伐', '讨伐金火龙和银火龙', '報奨金ゼロ　タイムアップ', '报酬金为零  时间结束', '大闘技場', '大竞技场', 'なし', '无', '依頼主：ギルドマネージャー<BR>おお、全てのハンターよ！より強き敵との邂逅を求めるものよ！気高き金銀の力を前にその誇りを示せ！見事この依頼を完遂できる者こそ真の狩人である！', '委托人：行會經理<BR>所有的獵人啊！尋求與更強大的敵人邂逅的東西吧！在高貴的金銀之力面前顯示妳的驕傲！能夠出色完成這個委托的人才是真正的獵人！', '/BONUS/MHPSP/m60019.mib', 0);
INSERT INTO `mhpquest` VALUES (19, 0, 60008, '【官方】怒りの黒狼鳥', '【官方】憤怒的黑狼鳥', '★★★★★★★', '6000ｚ', '1500ｚ', '50分', 'イャンガルルガの討伐', '讨伐黑狼鸟', '報奨金ゼロ　タイムアップ', '报酬金为零  时间结束', '森と丘', '森丘', 'なし', '无', '依頼主：十字傷の男<BR>ここいらに俺と同じ傷を持つ飛竜がきているようだ。俺はもう戦えん。どうだ？俺の代わりにあいつを狩ってくれないか？もちろん礼はするさ。頼んだぜ！', '委托人：十字傷口的男人<BR>這裏好像有和我有同樣傷痕的飛龍。我已經不能戰鬥了。怎麽樣？能代替我去打那家夥嗎？當然要道謝。拜托妳了！', '/BONUS/MHPSP/m60008.mib', 0);
INSERT INTO `mhpquest` VALUES (35, 1, 20, '【皓月測試】自製配信', '【皓月測試】自製配信', '--', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '待補充', '/BONUS/MHPSP/DIY/m64001.mib', 0);

SET FOREIGN_KEY_CHECKS = 1;
